In [33]:
import pandas as pd

In [34]:
people = {
    "first_name": ["John", "Tom", "Sarah"],
    "last_name": ["White", "Junior", "Li"],
    "email": ["jw@gmail.com", "tj@school.org", "sali@msn.info"]
}

In [35]:
df = pd.DataFrame(people)

In [36]:
df

  first_name last_name          email
0       John     White   jw@gmail.com
1        Tom    Junior  tj@school.org
2      Sarah        Li  sali@msn.info

In [37]:
df['full_name'] = df['first_name'] + ' ' + df['last_name']

In [38]:
df

  first_name last_name          email   full_name
0       John     White   jw@gmail.com  John White
1        Tom    Junior  tj@school.org  Tom Junior
2      Sarah        Li  sali@msn.info    Sarah Li

In [39]:
df.drop(columns=['first_name', 'last_name'], inplace=True)

In [40]:
df

           email   full_name
0   jw@gmail.com  John White
1  tj@school.org  Tom Junior
2  sali@msn.info    Sarah Li

In [41]:
df[['first_name', 'last_name']] = df['full_name'].str.split(' ', expand=True)

In [42]:
df

           email   full_name first_name last_name
0   jw@gmail.com  John White       John     White
1  tj@school.org  Tom Junior        Tom    Junior
2  sali@msn.info    Sarah Li      Sarah        Li

In [43]:
df.append({'full_name': 'Jesse Pinkman', 'email': 'jpink@man.gg'}, ignore_index=True)

AttributeError: 'DataFrame' object has no attribute 'append'

### Warning
The `append` is is removed from pandas. For more information, please read [this answer](https://stackoverflow.com/questions/75956209/error-dataframe-object-has-no-attribute-append) at stackoverflow. Have a check on that.

In [44]:
adam = {'full_name': ['Adam Badams'], 'email': ['badam2@jmail.com']}

In [45]:
adam_df = pd.DataFrame(adam)

In [46]:
df = pd.concat([df, adam_df], ignore_index=True)

In [47]:
df

              email    full_name first_name last_name
0      jw@gmail.com   John White       John     White
1     tj@school.org   Tom Junior        Tom    Junior
2     sali@msn.info     Sarah Li      Sarah        Li
3  badam2@jmail.com  Adam Badams        NaN       NaN

In [48]:
df.drop(index=1)

              email    full_name first_name last_name
0      jw@gmail.com   John White       John     White
2     sali@msn.info     Sarah Li      Sarah        Li
3  badam2@jmail.com  Adam Badams        NaN       NaN

In [49]:
df

              email    full_name first_name last_name
0      jw@gmail.com   John White       John     White
1     tj@school.org   Tom Junior        Tom    Junior
2     sali@msn.info     Sarah Li      Sarah        Li
3  badam2@jmail.com  Adam Badams        NaN       NaN

In [51]:
df.drop(index=df[df['email'].str.contains('.com')].index)

           email   full_name first_name last_name
1  tj@school.org  Tom Junior        Tom    Junior
2  sali@msn.info    Sarah Li      Sarah        Li

In [52]:
df

              email    full_name first_name last_name
0      jw@gmail.com   John White       John     White
1     tj@school.org   Tom Junior        Tom    Junior
2     sali@msn.info     Sarah Li      Sarah        Li
3  badam2@jmail.com  Adam Badams        NaN       NaN